parsing-tech-log/src/InformationRegisters/СостояниеОбработкиFSM/СостояниеОбработкиFSM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеОбработкиFSM</name>
  <resources>
    <name>ДатаИзмененияСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПрочитанныхДанных</name>
    <comment>Дата последней прочитанной записи из источника</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТекущееСостояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредыдущееСостояние</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбработаноСтрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФайлЗамера</name>
    <type>
      <types>CatalogRef.ФайлыЗамера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

parsing-tech-log/src/InformationRegisters/СостояниеОбработкиFSM/ManagerModule.bsl
Функция ПолучитьСостояние(ЗНАЧ ФайлЗамера) Экспорт
	Результат = Новый Структура("ДатаИзмененияСостояния,ДатаПрочитанныхДанных,ТекущееСостояние,ПредыдущееСостояние,ОбработаноСтрок", Дата(1,1,1), Дата(1,1,1),"","",0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	FSM.ТекущееСостояние КАК ТекущееСостояние,
	|	FSM.ПредыдущееСостояние КАК ПредыдущееСостояние,
	|	FSM.ОбработаноСтрок КАК ОбработаноСтрок,
	|	FSM.ДатаИзмененияСостояния КАК ДатаИзмененияСостояния,
	|	FSM.ДатаПрочитанныхДанных КАК ДатаПрочитанныхДанных
	|ИЗ
	|	РегистрСведений.СостояниеОбработкиFSM КАК FSM
	|ГДЕ
	|	FSM.ФайлЗамера = &ФайлЗамера";
	Запрос.УстановитьПараметр("ФайлЗамера", ФайлЗамера);
	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(Результат, РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьСостояние(
		ФайлЗамера, 
		ОбработаноСтрок,
		ДатаПрочитанныхДанных,
		ТекущееСостояние, 
		ПредыдущееСостояние) Экспорт
		
	ТекущееСостояниеFSM = ПолучитьСостояние(ФайлЗамера);
	Если ТекущееСостояниеFSM.ОбработаноСтрок = ОбработаноСтрок Тогда
		Возврат;
	КонецЕсли;	
		
	МенеджерЗаписи = РегистрыСведений.СостояниеОбработкиFSM.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ФайлЗамера 				= ФайлЗамера;
	МенеджерЗаписи.ТекущееСостояние 		= ТекущееСостояние;
	МенеджерЗаписи.ПредыдущееСостояние 		= ПредыдущееСостояние;
	МенеджерЗаписи.ДатаИзмененияСостояния 	= ТекущаяДата();
	МенеджерЗаписи.ДатаПрочитанныхДанных 	= ДатаПрочитанныхДанных;
	МенеджерЗаписи.ОбработаноСтрок 			= ОбработаноСтрок;
	МенеджерЗаписи.Записать();		
		
	
КонецПроцедуры
